# 1.字符串格式化
# ------------我叫xxx,我住xxx,我今年xxx岁,我喜欢xxxxx----
# name = input("请输入名字:")
# address = input("请输入住址:")
# age = int(input("请输入年龄:"))
# hobby = input("请输入你喜欢的选手:")

# %s 字符串占位,整数,小数都可以
# %d 占位整数数字 %f 占位小数
# s="我叫%s,我住%s,我今年%d岁,我喜欢%s" % (name,address,age,hobby)
# print(s)
# 上面这个的简化版
# s1 = "我叫{},我住{},我今年{}岁,我喜欢{}".format(name,address,age,hobby)
# print(s1)
# f-string
# s2 = f"我叫{name},我叫{name},我叫{name},我叫{name},我今年{age}岁,我叫{name},"
# print(s2)

# 2.字符串的索引和切片
# 索引:按照位置提取元素
# s="大陆赛区的美丽传说"
# print(s[3])
#  print(s[-1]) #倒数
# 切片:从一个字符串中提前一部分
# s="乱世小帅天下第一!"
# print(s[3:6])  #3开始,6结束,左闭右开
# print(s[:5])
# print(s[2:])
# print(s[:])
# print(s[-3:-1])# 还是左闭右开,目前只能从左往右切,输出为:第一
# print(s[-1:-4])# 错误代码,因为是从前往后取,[-1,-4]是从后往前
# 添加步长控制切片方向
s="87好帅我好爱~"
# print(s[:4:-1]) #-最后一位为-1:从右到左;在最后一位默认为1,从左到右
# print(s[:8:2])  # 最后一位是2:每间隔一个元素选取一个,输出:8好我爱
print(s[-1:-8:-2]) # 因为从后往前取,所以可以[-1:-10]